"1 161 1 4206624770 ,"
"input 1 3 320 320 ,"
" 383 384 386 387 389 391 392 394 395 397 399 400 402 403 405 406 408 409 411 412 414 416 417 419 420 422 423 425 426 428 429 431 432 434 435 436 437 447 449 450 451 452 462 464 465 467 468 470 472 473 475 476 478 479 481 482 484 485 487 488 490 491 493 494 496 497 499 500 501 502 512 514 515 516 517 527 529 530 532 533 535 537 538 540 541 543 544 546 547 549 550 552 553 555 556 558 559 561 563 564 566 567 569 570 572 573 575 576 578 579 581 582 583 584 594 596 597 598 599 609 611 612 614 615 617 619 620 621 622 624 625 626 627 628 629 639 640 641 651 652 653 655 657 659 661 662 664 665 667 668 669 670 672 673 674 675 677 678 boxes input scores ,"
"scores boxes ,"
" 160 ,"
"Convolution Conv_0 1 1 input 383 1 3 32 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU6 Clip_2 1 1 383 384 ,"
"Convolution Conv_3 1 1 384 386 32 1 32 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_5 1 1 386 387 ,"
"Convolution Conv_6 1 1 387 389 1 32 16 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_8 1 1 389 391 1 16 96 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_10 1 1 391 392 ,"
"Convolution Conv_11 1 1 392 394 96 1 96 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU6 Clip_13 1 1 394 395 ,"
"Convolution Conv_14 1 1 395 397 1 96 24 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_16 1 1 397 399 1 24 144 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_18 1 1 399 400 ,"
"Convolution Conv_19 1 1 400 402 144 1 144 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_21 1 1 402 403 ,"
"Convolution Conv_22 1 1 403 405 1 144 24 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_24 2 1 397 405 406 ,"
"Convolution Conv_25 1 1 406 408 1 24 144 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_27 1 1 408 409 ,"
"Convolution Conv_28 1 1 409 411 144 1 144 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU6 Clip_30 1 1 411 412 ,"
"Convolution Conv_31 1 1 412 414 1 144 32 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_33 1 1 414 416 1 32 192 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_35 1 1 416 417 ,"
"Convolution Conv_36 1 1 417 419 192 1 192 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_38 1 1 419 420 ,"
"Convolution Conv_39 1 1 420 422 1 192 32 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_41 2 1 414 422 423 ,"
"Convolution Conv_42 1 1 423 425 1 32 192 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_44 1 1 425 426 ,"
"Convolution Conv_45 1 1 426 428 192 1 192 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_47 1 1 428 429 ,"
"Convolution Conv_48 1 1 429 431 1 192 32 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_50 2 1 423 431 432 ,"
"Convolution Conv_51 1 1 432 434 32 1 32 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_53 1 1 434 435 ,"
"Convolution Conv_54 1 1 435 436 1 32 27 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_55 1 1 436 437 4 0 2 3 1 ,"
"Reshape Reshape_61 1 1 437 447 0 4 4 0 -1 3 1 ,"
"Convolution Conv_62 1 1 432 449 32 1 32 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_64 1 1 449 450 ,"
"Convolution Conv_65 1 1 450 451 1 32 36 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_66 1 1 451 452 4 0 2 3 1 ,"
"Reshape Reshape_72 1 1 452 462 0 4 4 0 -1 4 1 ,"
"Convolution Conv_73 1 1 432 464 1 32 192 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_75 1 1 464 465 ,"
"Convolution Conv_76 1 1 465 467 192 1 192 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU6 Clip_78 1 1 467 468 ,"
"Convolution Conv_79 1 1 468 470 1 192 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_81 1 1 470 472 1 64 384 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_83 1 1 472 473 ,"
"Convolution Conv_84 1 1 473 475 384 1 384 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_86 1 1 475 476 ,"
"Convolution Conv_87 1 1 476 478 1 384 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_89 2 1 470 478 479 ,"
"Convolution Conv_90 1 1 479 481 1 64 384 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_92 1 1 481 482 ,"
"Convolution Conv_93 1 1 482 484 384 1 384 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_95 1 1 484 485 ,"
"Convolution Conv_96 1 1 485 487 1 384 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_98 2 1 479 487 488 ,"
"Convolution Conv_99 1 1 488 490 1 64 384 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_101 1 1 490 491 ,"
"Convolution Conv_102 1 1 491 493 384 1 384 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_104 1 1 493 494 ,"
"Convolution Conv_105 1 1 494 496 1 384 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_107 2 1 488 496 497 ,"
"Convolution Conv_108 1 1 497 499 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_110 1 1 499 500 ,"
"Convolution Conv_111 1 1 500 501 1 64 18 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_112 1 1 501 502 4 0 2 3 1 ,"
"Reshape Reshape_118 1 1 502 512 0 4 4 0 -1 3 1 ,"
"Convolution Conv_119 1 1 497 514 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_121 1 1 514 515 ,"
"Convolution Conv_122 1 1 515 516 1 64 24 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_123 1 1 516 517 4 0 2 3 1 ,"
"Reshape Reshape_129 1 1 517 527 0 4 4 0 -1 4 1 ,"
"Convolution Conv_130 1 1 497 529 1 64 384 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_132 1 1 529 530 ,"
"Convolution Conv_133 1 1 530 532 384 1 384 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_135 1 1 532 533 ,"
"Convolution Conv_136 1 1 533 535 1 384 96 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_138 1 1 535 537 1 96 576 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_140 1 1 537 538 ,"
"Convolution Conv_141 1 1 538 540 576 1 576 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_143 1 1 540 541 ,"
"Convolution Conv_144 1 1 541 543 1 576 96 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_146 2 1 535 543 544 ,"
"Convolution Conv_147 1 1 544 546 1 96 576 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_149 1 1 546 547 ,"
"Convolution Conv_150 1 1 547 549 576 1 576 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_152 1 1 549 550 ,"
"Convolution Conv_153 1 1 550 552 1 576 96 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_155 2 1 544 552 553 ,"
"Convolution Conv_156 1 1 553 555 1 96 576 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_158 1 1 555 556 ,"
"Convolution Conv_159 1 1 556 558 576 1 576 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU6 Clip_161 1 1 558 559 ,"
"Convolution Conv_162 1 1 559 561 1 576 160 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_164 1 1 561 563 1 160 960 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_166 1 1 563 564 ,"
"Convolution Conv_167 1 1 564 566 960 1 960 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_169 1 1 566 567 ,"
"Convolution Conv_170 1 1 567 569 1 960 160 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_172 2 1 561 569 570 ,"
"Convolution Conv_173 1 1 570 572 1 160 960 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_175 1 1 572 573 ,"
"Convolution Conv_176 1 1 573 575 960 1 960 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_178 1 1 575 576 ,"
"Convolution Conv_179 1 1 576 578 1 960 160 1 1 1 1 0 0 1 -1 1 1 ,"
"Add Add_181 2 1 570 578 579 ,"
"Convolution Conv_182 1 1 579 581 160 1 160 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_184 1 1 581 582 ,"
"Convolution Conv_185 1 1 582 583 1 160 18 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_186 1 1 583 584 4 0 2 3 1 ,"
"Reshape Reshape_192 1 1 584 594 0 4 4 0 -1 3 1 ,"
"Convolution Conv_193 1 1 579 596 160 1 160 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_195 1 1 596 597 ,"
"Convolution Conv_196 1 1 597 598 1 160 24 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_197 1 1 598 599 4 0 2 3 1 ,"
"Reshape Reshape_203 1 1 599 609 0 4 4 0 -1 4 1 ,"
"Convolution Conv_204 1 1 579 611 1 160 960 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_206 1 1 611 612 ,"
"Convolution Conv_207 1 1 612 614 960 1 960 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU6 Clip_209 1 1 614 615 ,"
"Convolution Conv_210 1 1 615 617 1 960 320 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_212 1 1 617 619 1 320 960 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU6 Clip_214 1 1 619 620 ,"
"Convolution Conv_215 1 1 620 621 1 960 160 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_216 1 1 621 622 ,"
"Convolution Conv_217 1 1 622 624 160 1 160 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU6 Clip_219 1 1 624 625 ,"
"Convolution Conv_220 1 1 625 626 1 160 960 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_221 1 1 626 627 ,"
"Convolution Conv_222 1 1 627 628 1 960 27 3 3 1 1 1 1 1 -1 1 1 ,"
"Permute Transpose_223 1 1 628 629 4 0 2 3 1 ,"
"Reshape Reshape_229 1 1 629 639 0 4 4 0 -1 3 1 ,"
"Convolution Conv_230 1 1 627 640 1 960 36 3 3 1 1 1 1 1 -1 1 1 ,"
"Permute Transpose_231 1 1 640 641 4 0 2 3 1 ,"
"Reshape Reshape_237 1 1 641 651 0 4 4 0 -1 4 1 ,"
"Concat Concat_238 4 1 447 512 594 639 652 1 ,"
"Concat Concat_239 4 1 462 527 609 651 653 1 ,"
"SoftmaxCaffe Softmax_240 1 1 652 scores 2 ,"
"StridedSlice Slice_241 1 1 653 655 4 0 0 0 0 4 0 0 2 0 4 1 1 1 1 ,"
"Mul Mul_243 1 1 655 657 1 ,"
"Mul Mul_245 1 1 657 659 1 ,"
"Add Add_247 1 1 659 661 1 ,"
"StridedSlice Slice_248 1 1 653 662 4 0 0 2 0 4 0 0 0 0 4 1 1 1 1 ,"
"Mul Mul_250 1 1 662 664 1 ,"
"Exp Exp_251 1 1 664 665 ,"
"Mul Mul_253 1 1 665 667 1 ,"
"Concat Concat_254 2 1 661 667 668 2 ,"
"StridedSlice Slice_255 1 1 668 669 4 0 0 0 0 4 0 0 2 0 4 1 1 1 1 ,"
"StridedSlice Slice_256 1 1 668 670 4 0 0 2 0 4 0 0 0 0 4 1 1 1 1 ,"
"Mul Div_258 1 1 670 672 1 ,"
"Sub Sub_259 2 1 669 672 673 ,"
"StridedSlice Slice_260 1 1 668 674 4 0 0 0 0 4 0 0 2 0 4 1 1 1 1 ,"
"StridedSlice Slice_261 1 1 668 675 4 0 0 2 0 4 0 0 0 0 4 1 1 1 1 ,"
"Mul Div_263 1 1 675 677 1 ,"
"Add Add_264 2 1 674 677 678 ,"
"Concat Concat_265 2 1 673 678 boxes 2 ,"
