"1 130 1 4206624770 ,"
"input 1 3 320 320 ,"
" 247 250 253 256 259 262 265 268 271 274 277 280 283 288 295 302 305 308 314 315 316 317 318 319 320 330 331 332 333 334 344 347 350 353 356 359 362 363 364 365 366 376 377 378 379 380 390 393 396 399 402 403 404 405 406 416 417 418 419 420 430 431 432 433 434 435 436 437 438 448 449 450 460 461 462 464 466 468 470 471 473 474 476 477 478 479 482 483 484 485 488 489 491 494 497 500 503 506 509 512 515 518 521 524 527 530 533 536 539 542 545 548 551 554 557 560 563 566 569 572 575 578 581 584 587 590 593 boxes input scores ,"
"scores boxes ,"
" 129 ,"
"Convolution Conv_0 1 1 input 491 1 3 16 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_1 1 1 491 247 ,"
"Convolution Conv_2 1 1 247 494 16 1 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_3 1 1 494 250 ,"
"Convolution Conv_4 1 1 250 497 1 16 32 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_5 1 1 497 253 ,"
"Convolution Conv_6 1 1 253 500 32 1 32 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_7 1 1 500 256 ,"
"Convolution Conv_8 1 1 256 503 1 32 32 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_9 1 1 503 259 ,"
"Convolution Conv_10 1 1 259 506 32 1 32 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_11 1 1 506 262 ,"
"Convolution Conv_12 1 1 262 509 1 32 32 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_13 1 1 509 265 ,"
"Convolution Conv_14 1 1 265 512 32 1 32 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_15 1 1 512 268 ,"
"Convolution Conv_16 1 1 268 515 1 32 64 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_17 1 1 515 271 ,"
"Convolution Conv_18 1 1 271 518 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_19 1 1 518 274 ,"
"Convolution Conv_20 1 1 274 521 1 64 64 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_21 1 1 521 277 ,"
"Convolution Conv_22 1 1 277 524 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_23 1 1 524 280 ,"
"Convolution Conv_24 1 1 280 527 1 64 64 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_25 1 1 527 283 ,"
"Convolution Conv_26 1 1 283 530 1 64 8 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_27 1 1 530 533 1 8 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_28 1 1 533 288 ,"
"Convolution Conv_29 1 1 288 536 1 16 16 3 3 1 1 2 2 1 -1 2 2 ,"
"Convolution Conv_30 1 1 283 539 1 64 8 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_31 1 1 539 542 1 8 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_32 1 1 542 295 ,"
"Convolution Conv_33 1 1 295 545 1 16 16 3 3 1 1 3 3 1 -1 3 3 ,"
"Convolution Conv_34 1 1 283 548 1 64 8 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_35 1 1 548 551 1 8 12 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_36 1 1 551 302 ,"
"Convolution Conv_37 1 1 302 554 1 12 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_38 1 1 554 305 ,"
"Convolution Conv_39 1 1 305 557 1 16 16 3 3 1 1 5 5 1 -1 5 5 ,"
"Concat Concat_40 3 1 536 545 557 308 1 ,"
"Convolution Conv_41 1 1 308 560 1 48 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_42 1 1 283 563 1 64 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Mul Mul_44 1 1 560 314 1 ,"
"Add Add_45 2 1 314 563 315 ,"
"ReLU Relu_46 1 1 315 316 ,"
"Convolution Conv_47 1 1 316 317 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_48 1 1 317 318 ,"
"Convolution Conv_49 1 1 318 319 1 64 27 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_50 1 1 319 320 4 0 2 3 1 ,"
"Reshape Reshape_56 1 1 320 330 0 4 4 0 -1 3 1 ,"
"Convolution Conv_57 1 1 316 331 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_58 1 1 331 332 ,"
"Convolution Conv_59 1 1 332 333 1 64 36 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_60 1 1 333 334 4 0 2 3 1 ,"
"Reshape Reshape_66 1 1 334 344 0 4 4 0 -1 4 1 ,"
"Convolution Conv_67 1 1 316 566 64 1 64 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_68 1 1 566 347 ,"
"Convolution Conv_69 1 1 347 569 1 64 128 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_70 1 1 569 350 ,"
"Convolution Conv_71 1 1 350 572 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_72 1 1 572 353 ,"
"Convolution Conv_73 1 1 353 575 1 128 128 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_74 1 1 575 356 ,"
"Convolution Conv_75 1 1 356 578 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_76 1 1 578 359 ,"
"Convolution Conv_77 1 1 359 581 1 128 128 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_78 1 1 581 362 ,"
"Convolution Conv_79 1 1 362 363 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_80 1 1 363 364 ,"
"Convolution Conv_81 1 1 364 365 1 128 18 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_82 1 1 365 366 4 0 2 3 1 ,"
"Reshape Reshape_88 1 1 366 376 0 4 4 0 -1 3 1 ,"
"Convolution Conv_89 1 1 362 377 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_90 1 1 377 378 ,"
"Convolution Conv_91 1 1 378 379 1 128 24 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_92 1 1 379 380 4 0 2 3 1 ,"
"Reshape Reshape_98 1 1 380 390 0 4 4 0 -1 4 1 ,"
"Convolution Conv_99 1 1 362 584 128 1 128 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_100 1 1 584 393 ,"
"Convolution Conv_101 1 1 393 587 1 128 256 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_102 1 1 587 396 ,"
"Convolution Conv_103 1 1 396 590 256 1 256 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_104 1 1 590 399 ,"
"Convolution Conv_105 1 1 399 593 1 256 256 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_106 1 1 593 402 ,"
"Convolution Conv_107 1 1 402 403 256 1 256 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_108 1 1 403 404 ,"
"Convolution Conv_109 1 1 404 405 1 256 18 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_110 1 1 405 406 4 0 2 3 1 ,"
"Reshape Reshape_116 1 1 406 416 0 4 4 0 -1 3 1 ,"
"Convolution Conv_117 1 1 402 417 256 1 256 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_118 1 1 417 418 ,"
"Convolution Conv_119 1 1 418 419 1 256 24 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_120 1 1 419 420 4 0 2 3 1 ,"
"Reshape Reshape_126 1 1 420 430 0 4 4 0 -1 4 1 ,"
"Convolution Conv_127 1 1 402 431 1 256 64 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_128 1 1 431 432 ,"
"Convolution Conv_129 1 1 432 433 64 1 64 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_130 1 1 433 434 ,"
"Convolution Conv_131 1 1 434 435 1 64 256 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_132 1 1 435 436 ,"
"Convolution Conv_133 1 1 436 437 1 256 27 3 3 1 1 1 1 1 -1 1 1 ,"
"Permute Transpose_134 1 1 437 438 4 0 2 3 1 ,"
"Reshape Reshape_140 1 1 438 448 0 4 4 0 -1 3 1 ,"
"Convolution Conv_141 1 1 436 449 1 256 36 3 3 1 1 1 1 1 -1 1 1 ,"
"Permute Transpose_142 1 1 449 450 4 0 2 3 1 ,"
"Reshape Reshape_148 1 1 450 460 0 4 4 0 -1 4 1 ,"
"Concat Concat_149 4 1 330 376 416 448 461 1 ,"
"Concat Concat_150 4 1 344 390 430 460 462 1 ,"
"SoftmaxCaffe Softmax_151 1 1 461 scores 2 ,"
"StridedSlice Slice_152 1 1 462 464 4 0 0 0 0 4 0 0 2 0 4 1 1 1 1 ,"
"Mul Mul_154 1 1 464 466 1 ,"
"Mul Mul_156 1 1 466 468 1 ,"
"Add Add_158 1 1 468 470 1 ,"
"StridedSlice Slice_159 1 1 462 471 4 0 0 2 0 4 0 0 0 0 4 1 1 1 1 ,"
"Mul Mul_161 1 1 471 473 1 ,"
"Exp Exp_162 1 1 473 474 ,"
"Mul Mul_164 1 1 474 476 1 ,"
"Concat Concat_165 2 1 470 476 477 2 ,"
"StridedSlice Slice_166 1 1 477 478 4 0 0 0 0 4 0 0 2 0 4 1 1 1 1 ,"
"StridedSlice Slice_167 1 1 477 479 4 0 0 2 0 4 0 0 0 0 4 1 1 1 1 ,"
"Mul Div_168 1 1 479 482 1 ,"
"Sub Sub_169 2 1 478 482 483 ,"
"StridedSlice Slice_170 1 1 477 484 4 0 0 0 0 4 0 0 2 0 4 1 1 1 1 ,"
"StridedSlice Slice_171 1 1 477 485 4 0 0 2 0 4 0 0 0 0 4 1 1 1 1 ,"
"Mul Div_172 1 1 485 488 1 ,"
"Add Add_173 2 1 484 488 489 ,"
"Concat Concat_174 2 1 483 489 boxes 2 ,"
