"1 131 1 4206624770 ,"
"input 1 3 416 416 ,"
" 261 264 267 270 273 276 279 282 285 288 291 294 297 302 309 316 319 322 328 329 330 331 332 333 334 344 345 346 347 348 358 359 360 361 362 372 375 378 381 384 387 390 391 392 393 394 404 405 406 407 408 418 419 420 421 422 432 435 438 441 444 445 446 447 448 458 459 460 461 462 472 473 474 475 476 486 487 488 489 490 491 492 493 494 504 505 506 516 517 518 528 529 533 536 539 542 545 548 551 554 557 560 563 566 569 572 575 578 581 584 587 590 593 596 599 602 605 608 611 614 617 620 623 626 629 632 635 boxes input ldmks scores ,"
"scores boxes ldmks ,"
" 130 ,"
"Convolution Conv_0 1 1 input 533 1 3 16 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_1 1 1 533 261 ,"
"Convolution Conv_2 1 1 261 536 16 1 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_3 1 1 536 264 ,"
"Convolution Conv_4 1 1 264 539 1 16 32 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_5 1 1 539 267 ,"
"Convolution Conv_6 1 1 267 542 32 1 32 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_7 1 1 542 270 ,"
"Convolution Conv_8 1 1 270 545 1 32 32 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_9 1 1 545 273 ,"
"Convolution Conv_10 1 1 273 548 32 1 32 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_11 1 1 548 276 ,"
"Convolution Conv_12 1 1 276 551 1 32 32 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_13 1 1 551 279 ,"
"Convolution Conv_14 1 1 279 554 32 1 32 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_15 1 1 554 282 ,"
"Convolution Conv_16 1 1 282 557 1 32 64 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_17 1 1 557 285 ,"
"Convolution Conv_18 1 1 285 560 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_19 1 1 560 288 ,"
"Convolution Conv_20 1 1 288 563 1 64 64 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_21 1 1 563 291 ,"
"Convolution Conv_22 1 1 291 566 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_23 1 1 566 294 ,"
"Convolution Conv_24 1 1 294 569 1 64 64 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_25 1 1 569 297 ,"
"Convolution Conv_26 1 1 297 572 1 64 8 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_27 1 1 572 575 1 8 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_28 1 1 575 302 ,"
"Convolution Conv_29 1 1 302 578 1 16 16 3 3 1 1 2 2 1 -1 2 2 ,"
"Convolution Conv_30 1 1 297 581 1 64 8 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_31 1 1 581 584 1 8 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_32 1 1 584 309 ,"
"Convolution Conv_33 1 1 309 587 1 16 16 3 3 1 1 3 3 1 -1 3 3 ,"
"Convolution Conv_34 1 1 297 590 1 64 8 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_35 1 1 590 593 1 8 12 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_36 1 1 593 316 ,"
"Convolution Conv_37 1 1 316 596 1 12 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_38 1 1 596 319 ,"
"Convolution Conv_39 1 1 319 599 1 16 16 3 3 1 1 5 5 1 -1 5 5 ,"
"Concat Concat_40 3 1 578 587 599 322 1 ,"
"Convolution Conv_41 1 1 322 602 1 48 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_42 1 1 297 605 1 64 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Mul Mul_44 1 1 602 328 1 ,"
"Add Add_45 2 1 328 605 329 ,"
"ReLU Relu_46 1 1 329 330 ,"
"Convolution Conv_47 1 1 330 331 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_48 1 1 331 332 ,"
"Convolution Conv_49 1 1 332 333 1 64 6 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_50 1 1 333 334 4 0 2 3 1 ,"
"Reshape Reshape_56 1 1 334 344 0 4 4 0 -1 2 1 ,"
"Convolution Conv_57 1 1 330 345 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_58 1 1 345 346 ,"
"Convolution Conv_59 1 1 346 347 1 64 12 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_60 1 1 347 348 4 0 2 3 1 ,"
"Reshape Reshape_66 1 1 348 358 0 4 4 0 -1 4 1 ,"
"Convolution Conv_67 1 1 330 359 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_68 1 1 359 360 ,"
"Convolution Conv_69 1 1 360 361 1 64 30 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_70 1 1 361 362 4 0 2 3 1 ,"
"Reshape Reshape_76 1 1 362 372 0 4 4 0 -1 10 1 ,"
"Convolution Conv_77 1 1 330 608 64 1 64 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_78 1 1 608 375 ,"
"Convolution Conv_79 1 1 375 611 1 64 128 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_80 1 1 611 378 ,"
"Convolution Conv_81 1 1 378 614 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_82 1 1 614 381 ,"
"Convolution Conv_83 1 1 381 617 1 128 128 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_84 1 1 617 384 ,"
"Convolution Conv_85 1 1 384 620 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_86 1 1 620 387 ,"
"Convolution Conv_87 1 1 387 623 1 128 128 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_88 1 1 623 390 ,"
"Convolution Conv_89 1 1 390 391 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_90 1 1 391 392 ,"
"Convolution Conv_91 1 1 392 393 1 128 4 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_92 1 1 393 394 4 0 2 3 1 ,"
"Reshape Reshape_98 1 1 394 404 0 4 4 0 -1 2 1 ,"
"Convolution Conv_99 1 1 390 405 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_100 1 1 405 406 ,"
"Convolution Conv_101 1 1 406 407 1 128 8 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_102 1 1 407 408 4 0 2 3 1 ,"
"Reshape Reshape_108 1 1 408 418 0 4 4 0 -1 4 1 ,"
"Convolution Conv_109 1 1 390 419 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_110 1 1 419 420 ,"
"Convolution Conv_111 1 1 420 421 1 128 20 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_112 1 1 421 422 4 0 2 3 1 ,"
"Reshape Reshape_118 1 1 422 432 0 4 4 0 -1 10 1 ,"
"Convolution Conv_119 1 1 390 626 128 1 128 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_120 1 1 626 435 ,"
"Convolution Conv_121 1 1 435 629 1 128 256 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_122 1 1 629 438 ,"
"Convolution Conv_123 1 1 438 632 256 1 256 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_124 1 1 632 441 ,"
"Convolution Conv_125 1 1 441 635 1 256 256 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_126 1 1 635 444 ,"
"Convolution Conv_127 1 1 444 445 256 1 256 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_128 1 1 445 446 ,"
"Convolution Conv_129 1 1 446 447 1 256 4 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_130 1 1 447 448 4 0 2 3 1 ,"
"Reshape Reshape_136 1 1 448 458 0 4 4 0 -1 2 1 ,"
"Convolution Conv_137 1 1 444 459 256 1 256 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_138 1 1 459 460 ,"
"Convolution Conv_139 1 1 460 461 1 256 8 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_140 1 1 461 462 4 0 2 3 1 ,"
"Reshape Reshape_146 1 1 462 472 0 4 4 0 -1 4 1 ,"
"Convolution Conv_147 1 1 444 473 256 1 256 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_148 1 1 473 474 ,"
"Convolution Conv_149 1 1 474 475 1 256 20 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_150 1 1 475 476 4 0 2 3 1 ,"
"Reshape Reshape_156 1 1 476 486 0 4 4 0 -1 10 1 ,"
"Convolution Conv_157 1 1 444 487 1 256 64 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_158 1 1 487 488 ,"
"Convolution Conv_159 1 1 488 489 64 1 64 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_160 1 1 489 490 ,"
"Convolution Conv_161 1 1 490 491 1 64 256 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_162 1 1 491 492 ,"
"Convolution Conv_163 1 1 492 493 1 256 6 3 3 1 1 1 1 1 -1 1 1 ,"
"Permute Transpose_164 1 1 493 494 4 0 2 3 1 ,"
"Reshape Reshape_170 1 1 494 504 0 4 4 0 -1 2 1 ,"
"Convolution Conv_171 1 1 492 505 1 256 12 3 3 1 1 1 1 1 -1 1 1 ,"
"Permute Transpose_172 1 1 505 506 4 0 2 3 1 ,"
"Reshape Reshape_178 1 1 506 516 0 4 4 0 -1 4 1 ,"
"Convolution Conv_179 1 1 492 517 1 256 30 3 3 1 1 1 1 1 -1 1 1 ,"
"Permute Transpose_180 1 1 517 518 4 0 2 3 1 ,"
"Reshape Reshape_186 1 1 518 528 0 4 4 0 -1 10 1 ,"
"Concat Concat_187 4 1 344 404 458 504 529 1 ,"
"Concat Concat_188 4 1 358 418 472 516 boxes 1 ,"
"Concat Concat_189 4 1 372 432 486 528 ldmks 1 ,"
"SoftmaxCaffe Softmax_190 1 1 529 scores 2 ,"
