"1 170 1 4206624770 ,"
"input 1 3 416 416 ,"
" 261 264 267 270 273 276 279 282 285 288 291 294 297 302 309 316 319 322 328 329 330 331 332 333 334 344 345 346 347 348 358 359 360 361 362 372 375 378 381 384 387 390 391 392 393 394 404 405 406 407 408 418 419 420 421 422 432 435 438 441 444 445 446 447 448 458 459 460 461 462 472 473 474 475 476 486 487 488 489 490 491 492 493 494 504 505 506 516 517 518 528 529 530 531 533 535 537 539 540 542 543 545 546 547 548 551 552 553 554 557 558 560 562 564 566 567 569 571 573 574 576 578 580 581 583 585 587 588 590 592 594 596 599 602 605 608 611 614 617 620 623 626 629 632 635 638 641 644 647 650 653 656 659 662 665 668 671 674 677 680 683 686 689 692 695 698 boxes input ldmks scores ,"
"scores boxes ldmks ,"
" 169 ,"
"Convolution Conv_0 1 1 input 596 1 3 16 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_1 1 1 596 261 ,"
"Convolution Conv_2 1 1 261 599 16 1 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_3 1 1 599 264 ,"
"Convolution Conv_4 1 1 264 602 1 16 32 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_5 1 1 602 267 ,"
"Convolution Conv_6 1 1 267 605 32 1 32 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_7 1 1 605 270 ,"
"Convolution Conv_8 1 1 270 608 1 32 32 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_9 1 1 608 273 ,"
"Convolution Conv_10 1 1 273 611 32 1 32 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_11 1 1 611 276 ,"
"Convolution Conv_12 1 1 276 614 1 32 32 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_13 1 1 614 279 ,"
"Convolution Conv_14 1 1 279 617 32 1 32 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_15 1 1 617 282 ,"
"Convolution Conv_16 1 1 282 620 1 32 64 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_17 1 1 620 285 ,"
"Convolution Conv_18 1 1 285 623 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_19 1 1 623 288 ,"
"Convolution Conv_20 1 1 288 626 1 64 64 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_21 1 1 626 291 ,"
"Convolution Conv_22 1 1 291 629 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_23 1 1 629 294 ,"
"Convolution Conv_24 1 1 294 632 1 64 64 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_25 1 1 632 297 ,"
"Convolution Conv_26 1 1 297 635 1 64 8 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_27 1 1 635 638 1 8 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_28 1 1 638 302 ,"
"Convolution Conv_29 1 1 302 641 1 16 16 3 3 1 1 2 2 1 -1 2 2 ,"
"Convolution Conv_30 1 1 297 644 1 64 8 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_31 1 1 644 647 1 8 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_32 1 1 647 309 ,"
"Convolution Conv_33 1 1 309 650 1 16 16 3 3 1 1 3 3 1 -1 3 3 ,"
"Convolution Conv_34 1 1 297 653 1 64 8 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_35 1 1 653 656 1 8 12 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_36 1 1 656 316 ,"
"Convolution Conv_37 1 1 316 659 1 12 16 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_38 1 1 659 319 ,"
"Convolution Conv_39 1 1 319 662 1 16 16 3 3 1 1 5 5 1 -1 5 5 ,"
"Concat Concat_40 3 1 641 650 662 322 1 ,"
"Convolution Conv_41 1 1 322 665 1 48 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Convolution Conv_42 1 1 297 668 1 64 64 1 1 1 1 0 0 1 -1 1 1 ,"
"Mul Mul_44 1 1 665 328 1 ,"
"Add Add_45 2 1 328 668 329 ,"
"ReLU Relu_46 1 1 329 330 ,"
"Convolution Conv_47 1 1 330 331 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_48 1 1 331 332 ,"
"Convolution Conv_49 1 1 332 333 1 64 6 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_50 1 1 333 334 4 0 2 3 1 ,"
"Reshape Reshape_56 1 1 334 344 0 4 4 0 -1 2 1 ,"
"Convolution Conv_57 1 1 330 345 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_58 1 1 345 346 ,"
"Convolution Conv_59 1 1 346 347 1 64 12 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_60 1 1 347 348 4 0 2 3 1 ,"
"Reshape Reshape_66 1 1 348 358 0 4 4 0 -1 4 1 ,"
"Convolution Conv_67 1 1 330 359 64 1 64 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_68 1 1 359 360 ,"
"Convolution Conv_69 1 1 360 361 1 64 30 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_70 1 1 361 362 4 0 2 3 1 ,"
"Reshape Reshape_76 1 1 362 372 0 4 4 0 -1 10 1 ,"
"Convolution Conv_77 1 1 330 671 64 1 64 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_78 1 1 671 375 ,"
"Convolution Conv_79 1 1 375 674 1 64 128 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_80 1 1 674 378 ,"
"Convolution Conv_81 1 1 378 677 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_82 1 1 677 381 ,"
"Convolution Conv_83 1 1 381 680 1 128 128 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_84 1 1 680 384 ,"
"Convolution Conv_85 1 1 384 683 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_86 1 1 683 387 ,"
"Convolution Conv_87 1 1 387 686 1 128 128 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_88 1 1 686 390 ,"
"Convolution Conv_89 1 1 390 391 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_90 1 1 391 392 ,"
"Convolution Conv_91 1 1 392 393 1 128 4 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_92 1 1 393 394 4 0 2 3 1 ,"
"Reshape Reshape_98 1 1 394 404 0 4 4 0 -1 2 1 ,"
"Convolution Conv_99 1 1 390 405 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_100 1 1 405 406 ,"
"Convolution Conv_101 1 1 406 407 1 128 8 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_102 1 1 407 408 4 0 2 3 1 ,"
"Reshape Reshape_108 1 1 408 418 0 4 4 0 -1 4 1 ,"
"Convolution Conv_109 1 1 390 419 128 1 128 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_110 1 1 419 420 ,"
"Convolution Conv_111 1 1 420 421 1 128 20 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_112 1 1 421 422 4 0 2 3 1 ,"
"Reshape Reshape_118 1 1 422 432 0 4 4 0 -1 10 1 ,"
"Convolution Conv_119 1 1 390 689 128 1 128 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_120 1 1 689 435 ,"
"Convolution Conv_121 1 1 435 692 1 128 256 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_122 1 1 692 438 ,"
"Convolution Conv_123 1 1 438 695 256 1 256 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_124 1 1 695 441 ,"
"Convolution Conv_125 1 1 441 698 1 256 256 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_126 1 1 698 444 ,"
"Convolution Conv_127 1 1 444 445 256 1 256 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_128 1 1 445 446 ,"
"Convolution Conv_129 1 1 446 447 1 256 4 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_130 1 1 447 448 4 0 2 3 1 ,"
"Reshape Reshape_136 1 1 448 458 0 4 4 0 -1 2 1 ,"
"Convolution Conv_137 1 1 444 459 256 1 256 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_138 1 1 459 460 ,"
"Convolution Conv_139 1 1 460 461 1 256 8 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_140 1 1 461 462 4 0 2 3 1 ,"
"Reshape Reshape_146 1 1 462 472 0 4 4 0 -1 4 1 ,"
"Convolution Conv_147 1 1 444 473 256 1 256 3 3 1 1 1 1 1 -1 1 1 ,"
"ReLU Relu_148 1 1 473 474 ,"
"Convolution Conv_149 1 1 474 475 1 256 20 1 1 1 1 0 0 1 -1 1 1 ,"
"Permute Transpose_150 1 1 475 476 4 0 2 3 1 ,"
"Reshape Reshape_156 1 1 476 486 0 4 4 0 -1 10 1 ,"
"Convolution Conv_157 1 1 444 487 1 256 64 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_158 1 1 487 488 ,"
"Convolution Conv_159 1 1 488 489 64 1 64 3 3 2 2 1 1 1 -1 1 1 ,"
"ReLU Relu_160 1 1 489 490 ,"
"Convolution Conv_161 1 1 490 491 1 64 256 1 1 1 1 0 0 1 -1 1 1 ,"
"ReLU Relu_162 1 1 491 492 ,"
"Convolution Conv_163 1 1 492 493 1 256 6 3 3 1 1 1 1 1 -1 1 1 ,"
"Permute Transpose_164 1 1 493 494 4 0 2 3 1 ,"
"Reshape Reshape_170 1 1 494 504 0 4 4 0 -1 2 1 ,"
"Convolution Conv_171 1 1 492 505 1 256 12 3 3 1 1 1 1 1 -1 1 1 ,"
"Permute Transpose_172 1 1 505 506 4 0 2 3 1 ,"
"Reshape Reshape_178 1 1 506 516 0 4 4 0 -1 4 1 ,"
"Convolution Conv_179 1 1 492 517 1 256 30 3 3 1 1 1 1 1 -1 1 1 ,"
"Permute Transpose_180 1 1 517 518 4 0 2 3 1 ,"
"Reshape Reshape_186 1 1 518 528 0 4 4 0 -1 10 1 ,"
"Concat Concat_187 4 1 344 404 458 504 529 1 ,"
"Concat Concat_188 4 1 358 418 472 516 530 1 ,"
"Concat Concat_189 4 1 372 432 486 528 531 1 ,"
"SoftmaxCaffe Softmax_190 1 1 529 scores 2 ,"
"StridedSlice Slice_191 1 1 530 533 4 0 0 0 0 4 0 0 2 0 4 1 1 1 1 ,"
"Mul Mul_193 1 1 533 535 1 ,"
"Mul Mul_195 1 1 535 537 1 ,"
"Add Add_197 1 1 537 539 1 ,"
"StridedSlice Slice_198 1 1 530 540 4 0 0 2 0 4 0 0 0 0 4 1 1 1 1 ,"
"Mul Mul_200 1 1 540 542 1 ,"
"Exp Exp_201 1 1 542 543 ,"
"Mul Mul_203 1 1 543 545 1 ,"
"Concat Concat_204 2 1 539 545 546 2 ,"
"StridedSlice Slice_205 1 1 546 547 4 0 0 0 0 4 0 0 2 0 4 1 1 1 1 ,"
"StridedSlice Slice_206 1 1 546 548 4 0 0 2 0 4 0 0 0 0 4 1 1 1 1 ,"
"Mul Div_207 1 1 548 551 1 ,"
"Sub Sub_208 2 1 547 551 552 ,"
"StridedSlice Slice_209 1 1 546 553 4 0 0 0 0 4 0 0 2 0 4 1 1 1 1 ,"
"StridedSlice Slice_210 1 1 546 554 4 0 0 2 0 4 0 0 0 0 4 1 1 1 1 ,"
"Mul Div_211 1 1 554 557 1 ,"
"Add Add_212 2 1 553 557 558 ,"
"Concat Concat_213 2 1 552 558 boxes 2 ,"
"StridedSlice Slice_214 1 1 531 560 4 0 0 0 0 4 0 0 2 0 4 1 1 1 1 ,"
"Mul Mul_216 1 1 560 562 1 ,"
"Mul Mul_218 1 1 562 564 1 ,"
"Add Add_220 1 1 564 566 0 ,"
"StridedSlice Slice_221 1 1 531 567 4 0 0 2 0 4 0 0 4 0 4 1 1 1 1 ,"
"Mul Mul_223 1 1 567 569 1 ,"
"Mul Mul_225 1 1 569 571 1 ,"
"Add Add_227 1 1 571 573 0 ,"
"StridedSlice Slice_228 1 1 531 574 4 0 0 4 0 4 0 0 6 0 4 1 1 1 1 ,"
"Mul Mul_230 1 1 574 576 1 ,"
"Mul Mul_232 1 1 576 578 1 ,"
"Add Add_234 1 1 578 580 0 ,"
"StridedSlice Slice_235 1 1 531 581 4 0 0 6 0 4 0 0 8 0 4 1 1 1 1 ,"
"Mul Mul_237 1 1 581 583 1 ,"
"Mul Mul_239 1 1 583 585 1 ,"
"Add Add_241 1 1 585 587 0 ,"
"StridedSlice Slice_242 1 1 531 588 4 0 0 8 0 4 0 0 10 0 4 1 1 1 1 ,"
"Mul Mul_244 1 1 588 590 1 ,"
"Mul Mul_246 1 1 590 592 1 ,"
"Add Add_248 1 1 592 594 0 ,"
"Concat Concat_249 5 1 566 573 580 587 594 ldmks 2 ,"
